app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."name" ASC
---
  def index
    @tasks = Task.all.order(:name)