app/controllers/tasks_controller.rb

  def show
    id = params[:id].to_i
    @task = Task.find_by(id: id)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def complete
    @task = Task.find_by(id: params[:id].to_i)
    if @task.completed = true
      render :complete_task, status: :complete_task
      @complete_task = task.complete
      @task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", true], ["updated_at", "2018-09-25 00:57:02.335369"], ["id", 5]]

  def create
    @task = Task.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "submit pull request"], ["description", "get good grades"], ["created_at", "2018-09-25 01:56:26.372646"], ["updated_at", "2018-09-25 01:56:26.372646"]]

  def edit
  @task = Task.find_by(id: params[:id].to_i)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    task = Task.find_by(id: params[:id].to_i)
    task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "manufacture flash cards for studying"], ["updated_at", "2018-09-21 21:38:58.285474"], ["id", 5]]

    task = Task.find_by(id: params[:id].to_i)
    @deleted_task = task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 5]]